app/views/users/show.html.erb

        <p class="head_name">
            <% if @user_name.username.empty? %>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "kohei_web"], ["LIMIT", 1]]

                <% post = Post.find_by(id: user_like.post_id) %>
                <% user = User.find_by(id: post.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]