app/controllers/home_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    if !user_signed_in?
      redirect_to "/welcome/"
    else
      f_users = Follow.where(user_id: current_user.id)
      u_post = []

      f_users.each do |f_user|
        post = Post.where(user_id: f_user.f_id).to_a
        if !post.empty?