app/controllers/onemessages_controller.rb

SELECT  "onemessages".* FROM "onemessages" WHERE "onemessages"."onemessage_uid" = ? LIMIT ?  [["onemessage_uid", "1"], ["LIMIT", 1]]
---
  def edit
    @msg = Onemessage.find_by(onemessage_uid: current_user.id)

SELECT  "onemessages".* FROM "onemessages" WHERE "onemessages"."onemessage_uid" = ? LIMIT ?  [["onemessage_uid", "1"], ["LIMIT", 1]]
UPDATE "onemessages" SET "message" = ?, "updated_at" = ? WHERE "onemessages"."id" = ?  [["message", "aaaaaaaaaaa\r\naaaa"], ["updated_at", "2020-05-23 14:38:14.146627"], ["id", 7]]
---
  def update
    @msg = Onemessage.find_by(onemessage_uid: current_user.id)
    if @msg.update(onemessage_params)