app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "comment", "p_userid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
---
  def edit
    @post = Post.find_by(id: params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "posts" SET "comment" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
  def update
    @post = Post.find_by(id: params[:id])
    if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 32]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.destroy