app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."profile_uid" = ? LIMIT ?  [["profile_uid", "2"], ["LIMIT", 1]]
---
  def new
    profile = Profile.find_by(profile_uid: current_user.id)

INSERT INTO "profiles" ("sns_t", "sns_f", "sns_i", "sns_l", "userlink", "trendartist", "fvcate", "fvartist", "fvsong", "fvmv", "myband", "h_year1", "h_year2", "h_year3", "h_year4", "h_year5", "h_content1", "h_content2", "h_content3", "h_content4", "h_content5", "created_at", "updated_at", "profile_uid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(profile_params)
    if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."profile_uid" = ? LIMIT ?  [["profile_uid", "1"], ["LIMIT", 1]]
---
  def edit
    @profile = Profile.find_by(profile_uid: current_user.id)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."profile_uid" = ? LIMIT ?  [["profile_uid", "1"], ["LIMIT", 1]]
UPDATE "profiles" SET "h_year1" = ?, "h_year2" = ?, "h_year3" = ?, "h_year4" = ?, "h_year5" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["h_year1", "2000"], ["h_year2", "2005"], ["h_year3", "2010"], ["h_year4", "2015"], ["h_year5", "2020"], ["updated_at", "2020-05-23 14:16:11.392848"], ["id", 1]]
---
  def update
    @profile = Profile.find_by(profile_uid: current_user.id)
    if @profile.update(profile_params)