app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."userid" = ? LIMIT ?  [["userid", "kohei"], ["LIMIT", 1]]
SELECT  "onemessages".* FROM "onemessages" WHERE "onemessages"."onemessage_uid" = ? LIMIT ?  [["onemessage_uid", "2"], ["LIMIT", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."profile_uid" = ? LIMIT ?  [["profile_uid", "2"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."p_userid" = ? ORDER BY "posts"."created_at" DESC  [["p_userid", "1"]]
---
  def show
    @user = User.find_by(userid: params[:userid])
    if !@user
      render "/users/nouser"
    else
      @msg = Onemessage.find_by(onemessage_uid: @user.id)
      @profile = Profile.find_by(profile_uid: @user.id)
      @post = Post.where(p_userid: @user.id).order(created_at: "DESC")